In [1]:
# Scrap for test

In [2]:
import pandas as pd
import numpy as np

data = {'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
        'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
        'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

df = pd.DataFrame(data, index=labels)

In [3]:
df.head()

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no

In [4]:
df.loc[(df['animal']=='cat') & df['age'] < 3]

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

In [9]:
def filter_animals(df,animal):
    filtered_df = df.loc[(df['animal']==str(animal)) & (df['age'] < 3)]
    return filtered_df

In [10]:
filter_animals(df,'cat')

  animal  age  visits priority
a    cat  2.5       1      yes
f    cat  2.0       3       no

In [31]:
import pandas as pd
import numpy as np

data = {'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
        'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
        'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

df = pd.DataFrame(data, index=labels)

In [32]:
df.head()

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no

In [35]:
def filter_dataframe(df):
    new_df = df.select_dtypes(exclude='object')
    new_df = new_df.dropna()
    return new_df

In [36]:
filter_dataframe(df)

   age  visits
a  2.5       1
b  3.0       3
c  0.5       2
e  5.0       2
f  2.0       3
g  4.5       1
i  7.0       2
j  3.0       1

In [19]:
df2.head()

   age  visits
a  2.5       1
b  3.0       3
c  0.5       2
d  NaN       3
e  5.0       2

In [29]:
df3 = df2.dropna()

In [30]:
df3.head()

   age  visits
a  2.5       1
b  3.0       3
c  0.5       2
e  5.0       2
f  2.0       3

In [37]:
import pandas as pd
import numpy as np

#Create a Dictionary of series
d = {'Name':pd.Series(['Andres','James','David','Vin','Steve','David','Jack',
   'Lee','David','Gasper','Betina','Andres']),
   'Age':pd.Series([25,26,25,23,30,29,23,34,40,30,51,46]),
   'Rating':pd.Series([4.23,3.24,3.98,2.56,3.20,4.6,3.8,3.78,2.98,4.80,4.10,3.65])
}

#Create a DataFrame
df = pd.DataFrame(d)

In [38]:
df.head()

     Name  Age  Rating
0  Andres   25    4.23
1   James   26    3.24
2   David   25    3.98
3     Vin   23    2.56
4   Steve   30    3.20

In [71]:
def compute_statistics(df):
    comm_name = df['Name'].mode()
    avg_age = df['Age'].mean()
    iqr_rating = df['Rating'].quantile(0.75) - df['Rating'].quantile(0.25)
    return (comm_name.loc[0], float(avg_age), float(iqr_rating))

In [72]:
output = compute_statistics(df)

In [73]:
print(output)

('David', 31.833333333333332, 0.9024999999999999)

In [69]:
type(output[2])

float

In [60]:
mode_name = df['Name'].mode()

In [65]:
mode_name.iloc[0]

'David'

In [40]:
df['Age'].mean()

31.833333333333332

In [56]:
iqr_rating = float(df['Rating'].quantile(0.75) - df['Rating'].quantile(0.25))

In [57]:
type(iqr_rating)

float

In [42]:
df_desc = df.describe()

In [44]:
df_desc

             Age     Rating
count  12.000000  12.000000
mean   31.833333   3.743333
std     9.232682   0.661628
min    23.000000   2.560000
25%    25.000000   3.230000
50%    29.500000   3.790000
75%    35.500000   4.132500
max    51.000000   4.800000

In [49]:
df_desc.iloc[6, 1]

4.1325

In [50]:
df_desc.iloc[4, 1]

3.2300000000000004

SELECT first_name, last_name, manager_id 
FROM employees
WHERE department_id IN
(SELECT department_id FROM departments WHERE location_id IN (
SELECT location_id FROM locations WHERE country_id='US'));

/* final answer to 3 */ 
SELECT first_name, last_name, manager_id
FROM employees
WHERE manager_id IN 
(SELECT employee_id FROM employees WHERE department_id IN
(SELECT department_id FROM departments WHERE location_id IN 
(SELECT location_id FROM locations WHERE country_id='US')));

/* answer to 4 */ 
SELECT job_id, (MAX(salary)- MIN(salary)) AS salary_span
FROM employees
WHERE job_id IS NOT 9
GROUP BY job_id
ORDER BY salary_span DESC;